import React from 'react';
import './GameInfo.css';

const GameInfo = ({ onClose }) => {
  return (
    <div className="game-info-container">
      <div className="game-info-content">
        <h1>ברוכים הבאים למשחק הטריוויה!</h1>
        <p>
          במשחק הזה, תתמודדו עם שאלות טריוויה במגוון שלבים. כל שלב כולל חמש שאלות, והניקוד עולה עם כל שלב.
          עליכם לנסות לענות נכון על כמה שיותר שאלות כדי לצבור נקודות ולעלות לשלב הבא.
        </p>
        <h2>חוקי המשחק:</h2>
        <ul>
          <li>בכל שלב יהיו 5 שאלות.</li>
          <li>בשלב הראשון, כל תשובה נכונה תזכה אתכם ב-10 נקודות, ובשלבים הבאים הניקוד עולה.</li>
          <li>יש לכם 5 פסילות. כל תשובה לא נכונה תגרום לאובדן פסילה.</li>
          <li>אם אוזלות כל הפסילות שלכם, המשחק יסתיים ואתם לא תצברו נקודות נוספות.</li>
          <li>בסוף כל שלב, תוכל להחליט אם להמשיך לשלב הבא או לצאת מהמשחק עם הנקודות שצברת.</li>
        </ul>
        <button className="game-info-close" onClick={onClose}>הבנתי, להתחיל לשחק!</button>
      </div>
    </div>
  );
};

export default GameInfo;
